# -*- coding: utf-8 -*-
def list2dict(l):
    d = {}
    for i in l:
        if i not in d:
            d[i]=1
    return d
AEIOUY_VN = list("aáàảãạăắằẳẵặâấầẩẫậeéèẻẽẹêếềểễệiíìỉĩịoóòỏõọôốồổỗộơớờởỡợuúùủũụưứừửữựyýỳỷỹỵ")
AEIOUYD = ["a", "e", "i", "o", "u", "y", "d"]
AEIOUYD_VN = list("aáàảãạăắằẳẵặâấầẩẫậeéèẻẽẹêếềểễệiíìỉĩịoóòỏõọôốồổỗộơớờởỡợuúùủũụưứừửữựyýỳỷỹỵdđ")
A_LIST = list("aáàảãạăắằẳẵặâấầẩẫậ")
AW_list =list("ăắằẳẵặ")
AA_list =list("âấầẩẫậ")
E_LIST = list("eéèẻẽẹêếềểễệ")
EE_LIST = list("êếềểễệ")
I_LIST = list("iíìỉĩị")
O_LIST = list("oóòỏõọôốồổỗộơớờởỡợ")
OO_LIST = list("ôốồổỗộ")
OW_LIST = list("ơớờởỡợ")
U_LIST = list("uúùủũụưứừửữự")
UW_LIST = list("ưứừửữự")
Y_LIST = list("yýỳỷỹỵ")
D_LIST = list("dđ")
LEGAL = " !\"#$%&'()*+,-./0123456789:;<=>?@[\\]^_`abcdefghijklmnopqrstuvwxyzáàảãạăắằẳẵặâấầẩẫậéèẻẽẹêếềểễệíìỉĩịóòỏõọôốồổỗộơớờởỡợúùủũụưứừửữựýỳỷỹỵđ{|}~"
PUNCT = "!\"#$%&'()*+,-./:;<=>?@[\\]^_`{|}~"
PUNCT_LM = "!\"#$%&'()*+,-./:;<=>?@[\\]^_`{|}~…’—‘"
VN_CHAR = 'abcdefghijklmnopqrstuvwxyzáàảãạăắằẳẵặâấầẩẫậéèẻẽẹêếềểễệíìỉĩịóòỏõọôốồổỗộơớờởỡợúùủũụưứừửữựýỳỷỹỵđ'
EN_CHAR = 'abcdefghijklmnopqrstuvwxyz'
NO_DIACRITIC_VN_CHAR = 'aăâbcdđeêghiklmnopqrstuvxy'
DIACRITIC_LIST = ['ngang', 'sac', 'huyen', 'hoi', 'nga', 'nang']
HUYEN = 'àằầùừèềòồờìỳ'
SAC = 'áắấúứéếóốớíý'
HOI = 'ảẳẩủửẻểỏổởỉỷ'
NGA = 'ãẵẫũữẽễõỗỡĩỹ'
NANG = 'ạặậụựẹệọộợịỵ'
CONSONANT = ['b', 'c', 'd', 'đ', 'g', 'h', 'k', 'l', 'm', 'n', 'p', 'q', 'r', 's', 't', 'v', 'x', 'ch', 'gh', 'gi', 'kh', 'ng', 'ngh', 'nh', 'th', 'tr', 'qu']
VOWEL = ['a', 'ă', 'â', 'e', 'ê', 'i', 'o', 'ô', 'ơ', 'u', 'ư', 'y', 'ai', 'ao',
'au', 'âu', 'ay', 'ây', 'eo', 'êu', 'ia', 'iê', 'yê', 'iu', 'oa', 'oă', 'oe', 'oi', 'ôi', 'ơi',
'oo', 'ôô', 'ua', 'uă', 'uâ', 'ưa', 'uê', 'ui', 'ưi', 'uơ', 'ưu', 'uy',
'iêu', 'yêu', 'oai', 'oao', 'oay', 'oeo', 'uao', 'uây', 'uôi', 'ươi', 'ươu', 'uya', 'uyê', 'uyu'] 
dau_cau_char = 'áàảãạăắằẳẵặâấầẩẫậéèẻẽẹêếềểễệíìỉĩịóòỏõọôốồổỗộơớờởỡợúùủũụưứừửữựýỳỷỹỵđ'
dau_cau_char = list2dict(dau_cau_char)
VN_CHAR = list2dict(VN_CHAR)
EE_DICT = {
        'ê':'ê',
        'ế':'ế',
        'ể':'ể',
        'ệ':'ệ',
        'ề':'ề',
        'ễ':'ễ',
        'e':'ê',
        'é':'ế',
        'ẻ':'ể',
        'ẹ':'ệ',
        'è':'ề',
        'ẽ':'ễ'
}
UW_DICT ={
    'u':'ư',
    'ú':'ứ',
    'ụ':'ự',
    'ủ':'ử',
    'ũ':'ữ',
    'ù':'ừ'
}
OW_DICT ={
    'o':'ơ',
    'ó':'ớ',
    'ỏ':'ở',
    'ọ':'ợ',
    'ò':'ờ',
    'õ':'ỡ'
}
bo_dau = {
    'a': "aáàảãạ",
    'ă': "ăắằẳẵặ",
    'â': "âấầẩẫậ",
    'e': "eéèẻẽẹ",
    'ê': "êếềểễệ",
    'i': "iíìỉĩị",
    'o': "oóòỏõọ",
    'ô': "ôốồổỗộ",
    'ơ': "ơớờởỡợ",
    'u': "uúùủũụ",
    'ư': "ưứừửữự",
    'y': "yýỳỷỹỵ"
}

get_no_tone ={}
for c in bo_dau:
    for dau in bo_dau[c]:
        get_no_tone[dau]= c
for c in EN_CHAR:
    get_no_tone[c]= c
get_no_tone['đ'] = 'đ'
y_vs_i ={
    'uyêt':'uyêt',
    'uynh':'uynh',
    'uiên':'uyen',
    'uinh':'uynh',
    'uiêt':'uyêt',
    'uiên':'uyên',
    'uich':'uych',
    'ưy':'ưi',
    'oy':'oi',
    'ôy':'ôi',
    'ơy':'ơi',
    'âi':'ây',
    'ya':'ia',
    'ym':'im',
    'yn':'in',
    'ych':'ich',
    'yp':'ip',
    'yu':'iu',
    'yt':'it',
    'qui':'quy',
    'yêc':'iêc',
    'yêp':'iêp',
    'yêt':'iêt',
    'yêng':'iêng',
    'yng':'ing',
    'ynh':'inh',
    'uit':'uyt',
    'uia':'uya'


}
# closely_pronunciation = {'l': ['n'], 'n': ['l'], 'ch': ['tr'], 'tr': ['ch'], 'x': ['s'], 's': ['x'], 'r': ['d', 'gi', 'v'],
#                        'd': ['r', 'gi', 'v'], 'gi': ['r', 'd', 'v'], 'v': ['r', 'gi', 'd']}
closely_pronunciation = {'ch': ['tr'], 'tr': ['ch'], 'x': ['s'], 's': ['x'], 'r': ['d', 'gi'],
                       'd': ['r', 'gi'], 'gi': ['r', 'd'], 'm' : ['n', 'ng'], 'n' : ['m', 'ng', 'l'], 'l' : ['n']}
danh_dau={
    # 'gia':2,
    # 'giư':2,
    # 'giê':2,
    # 'giu':2,
    'uyn':1,
    'qua':2,
    'uay':1,
    'uây':1,
    'uyê':2,
    'ươu':1,
    'iêu':1,
    'oay':1,
    'oac':1,
    'oat':1,
    'ươi':1,
    'uôi':1,
    'oai':1,
    'uai':1,
    'oen':1,
    'oan':1,
    'oam':1,
    'oet':1,
    'oat':1,
    'oăc':1,
    'iên':1,
    'yêu':1,
    'eo': 0, 
    'ao':0,
    'ai':0,
    'oe':0,
    'oa':0,
    'oi':0,
    'êu':0,
    'ơi':0,
    'ôi':0,
    'ia':0,
    'iu':0, 
    'ưa':0,
    'ưi':0, 
    'ưu':0,
    'ua':0,
    'uê':1,
    'ui':0,
    'uy':0,
    'oă':1,
    'uâ':1,
    'iê':1,
    'yê':1,
    'uô':1,
    'ươ':1,
    'ay':0,
    'âu':0,
    'ây':0,
    'au':0
}
near_char = {}
near_char['a'] = ['q', 'w', 'z', 'x', 's']
near_char['b'] = ['v', 'f', 'g', 'h', 'n', ' ']
near_char['c'] = ['x', 's', 'd', 'f', 'v']
near_char['d'] = ['x', 's', 'w', 'e', 'r', 'f', 'v', 'c']
near_char['e'] = ['w', 's', 'd', 'f', 'r']
near_char['f'] = ['c', 'd', 'e', 'r', 't', 'g', 'b', 'v']
near_char['g'] = ['r', 'f', 'v', 't', 'b', 'y', 'h', 'n']
near_char['h'] = ['b', 'g', 't', 'y', 'u', 'j', 'm', 'n']
near_char['i'] = ['u', 'j', 'k', 'l', 'o']
near_char['j'] = ['n', 'h', 'y', 'u', 'i', 'k', 'm']
near_char['k'] = ['u', 'j', 'm', 'l', 'o']
near_char['l'] = ['p', 'o', 'i', 'k', 'm']
near_char['m'] = ['n', 'h', 'j', 'k', 'l']
near_char['n'] = ['b', 'g', 'h', 'j', 'm']
near_char['o'] = ['i', 'k', 'l', 'p']
near_char['p'] = ['o', 'l']
near_char['q'] = ['w', 'a']
near_char['r'] = ['e', 'd', 'f', 'g', 't']
near_char['s'] = ['q', 'w', 'e', 'z', 'x', 'c']
near_char['t'] = ['r', 'f', 'g', 'h', 'y']
near_char['u'] = ['y', 'h', 'j', 'k', 'i']
near_char['v'] = ['', 'c', 'd', 'f', 'g', 'b']
near_char['w'] = ['q', 'a', 's', 'd', 'e']
near_char['x'] = ['z', 'a', 's', 'd', 'c']
near_char['y'] = ['t', 'g', 'h', 'j', 'u']
near_char['z'] = ['x', 's', 'a']
near_char['1'] = ['q', 'w']
near_char['2'] = ['q', 'w', 'e']
near_char['3'] = ['w', 'e', 'r']
near_char['4'] = ['e', 'r', 't']
near_char['5'] = ['r', 't', 'y']
near_char['6'] = ['t', 'y', 'u']
near_char['7'] = ['y', 'u', 'i']
near_char['8'] = ['u', 'i', 'o']
near_char['9'] = ['i', 'o', 'p']
near_char['0'] = ['o', 'p']

def noise_telex(word):
        # cach 1: viet day du dau tai cho
    noise_tele1 = {'à': 'af', 'á': 'as', 'ã': 'ax', 'ạ': 'aj', 'ả': 'ar',
                  'â': 'aa', 'ấ': ['aas', 'asa'], 'ầ': ['aaf', 'afa'], 'ẫ': ['aax', 'axa'], 'ẩ': ['aar', 'ara'], 'ậ': ['aaj', 'aja'],
                  'ă': 'aw', 'ắ': ['aws', 'asw'], 'ằ': ['awf', 'afw'], 'ẵ': ['awx', 'axw'], 'ẳ': ['awr', 'arw'], 'ặ': ['awj', 'ajw'],
                  'ê': 'ee', 'ề': ['eef', 'efe'], 'ế': ['ees', 'ese'], 'ễ': ['eex', 'exe'], 'ể': ['eer', 'ere'], 'ệ': ['eej', 'eje'],
                  'é': 'es', 'è': 'ef', 'ẽ': 'ex', 'ẻ': 'er', 'ẹ': 'ej',
                  'ó': 'os', 'ò': 'of', 'õ': 'ox', 'ỏ': 'or', 'ọ': 'oj',
                  'ô': 'oo', 'ồ': ['oof', 'ofo'], 'ộ': ['ooj', 'ojo'], 'ổ': ['oor', 'oro'], 'ỗ': ['oox', 'oxo'], 'ố': ['oos', 'oso'],
                  'ơ': 'ow', 'ớ': ['ows', 'osw'], 'ờ': ['owf', 'ofw'], 'ở': ['owr', 'orw'], 'ợ': ['owj', 'ojw'], 'ỡ': ['owx', 'oxw'],
                  'ụ': 'uj', 'ú': 'us', 'ũ': 'ux', 'ủ': 'ur', 'ù': 'uf',
                  'ư': 'uw', 'ứ': ['uws', 'usw'], 'ừ': ['uwf', 'ufw'], 'ữ': ['uwx', 'uxw'], 'ử': ['uwr', 'urw'], 'ự': ['uwj', 'ujw'],
                  'ý': 'ys', 'ỳ': 'yf', 'ỷ': 'yr', 'ỹ': 'yx', 'ỵ': 'yj',
                  'í': 'is', 'ì': 'if', 'ĩ': 'ix', 'ỉ': 'ir', 'ị': 'ij',
                  'đ': 'dd'}
    # 67
    # viet moi dau o cuoi
    noise_tele2 = {'à': ['a', 'f'], 'á': ['a', 's'], 'ã': ['a', 'x'], 'ạ': ['a', 'j'], 'ả': ['a', 'r'],
                   'â': 'aa', 'ấ': ['aa', 's'], 'ầ': ['aa', 'f'], 'ẫ': ['aa', 'x'], 'ẩ': ['aa', 'r'], 'ậ': ['aa', 'j'],
                   'ă': 'aw', 'ắ': ['aw', 's'], 'ằ': ['aw', 'f'], 'ẵ': ['aw', 'x'], 'ẳ': ['aw', 'r'], 'ặ': ['aw', 'j'],
                   'ê': 'ee', 'ề': ['ee', 'f'], 'ế': ['ee', 's'], 'ễ': ['ee', 'x'], 'ể': ['ee', 'r'], 'ệ': ['ee', 'j'],
                   'é': ['e', 's'], 'è': ['e', 'f'], 'ẽ': ['e', 'x'], 'ẻ': ['e', 'r'], 'ẹ': ['e', 'j'],
                   'ó': ['o', 's'], 'ò': ['o', 'f'], 'õ': ['o', 'x'], 'ỏ': ['o', 'r'], 'ọ': ['o', 'j'],
                   'ô': 'oo', 'ồ': ['oo', 'f'], 'ộ': ['oo', 'j'], 'ổ': ['oo', 'r'], 'ỗ': ['oo', 'x'], 'ố': ['oo', 's'],
                   'ơ': 'ow', 'ớ': ['ow', 's'], 'ờ': ['ow', 'f'], 'ở': ['ow', 'r'], 'ợ': ['ow', 'j'], 'ỡ': ['ow', 'x'],
                   'ụ': ['u', 'j'], 'ú': ['u', 's'], 'ũ': ['u', 'x'], 'ủ': ['u', 'r'], 'ù': ['u', 'f'],
                   'ư': 'uw', 'ứ': ['uw', 's'], 'ừ': ['uw', 'f'], 'ữ': ['uw', 'x'], 'ử': ['uw', 'r'], 'ự': ['uw', 'j'],
                   'ý': ['y', 's'], 'ỳ': ['y', 'f'], 'ỷ': ['y', 'r'], 'ỹ': ['y', 'x'], 'ỵ': ['y', 'j'],
                   'í': ['i', 's'], 'ì': ['i', 'f'], 'ĩ': ['i', 'x'], 'ỉ': ['i', 'r'], 'ị': ['i', 'j'],
                   'đ': 'dd'}

    # viet day du tai cuoi

    noise_tele3 = {'à': ['a', 'f'], 'á': ['a', 's'], 'ã': ['a', 'x'], 'ạ': ['a', 'j'], 'ả': ['a', 'r'],
                   'â': ['a', 'a'], 'ấ': ['a', 'as', 'sa'], 'ầ': ['a', 'af', 'fa'], 'ẫ': ['a', 'ax', 'xa'], 'ẩ': ['a', 'ar', 'ra'], 'ậ': ['a', 'aj', 'ja'],
                   'ă': ['a', 'w'], 'ắ': ['a', 'ws', 'sw'], 'ằ': ['a', 'wf', 'fw'], 'ẵ': ['a', 'wx', 'xw'], 'ẳ': ['a', 'wr', 'rw'], 'ặ': ['a', 'wj', 'jw'],
                   'ê': ['e', 'e'], 'ề': ['e', 'ef', 'fe'], 'ế': ['e', 'es', 'se'], 'ễ': ['e', 'ex', 'xe'], 'ể': ['e', 'er', 're'], 'ệ': ['e', 'ej', 'je'],
                   'é': ['e', 's'], 'è': ['e', 'f'], 'ẽ': ['e', 'x'], 'ẻ': ['e', 'r'], 'ẹ': ['e', 'j'],
                   'ó': ['o', 's'], 'ò': ['o', 'f'], 'õ': ['o', 'x'], 'ỏ': ['o', 'r'], 'ọ': ['o', 'j'],
                   'ô': ['o', 'o'], 'ồ': ['o', 'of', 'fo'], 'ộ': ['o', 'oj', 'jo'], 'ổ': ['o', 'or', 'ro'], 'ỗ': ['o', 'ox', 'xo'], 'ố': ['o', 'os', 'so'],
                   'ơ': ['o', 'w'], 'ớ': ['o', 'ws', 'sw'], 'ờ': ['o', 'wf', 'fw'], 'ở': ['o', 'wr', 'rw'], 'ợ': ['o', 'wj', 'jw'], 'ỡ': ['o', 'wx', 'xw'],
                   'ụ': ['u', 'j'], 'ú': ['u', 's'], 'ũ': ['u', 'x'], 'ủ': ['u', 'r'], 'ù': ['u', 'f'],
                   'ư': ['u', 'w'], 'ứ': ['u', 'ws', 'sw'], 'ừ': ['u', 'wf', 'fw'], 'ữ': ['u', 'wx', 'xw'], 'ử': ['u', 'wr', 'rw'], 'ự': ['u', 'wj', 'jw'],
                   'ý': ['y', 's'], 'ỳ': ['y', 'f'], 'ỷ': ['y', 'r'], 'ỹ': ['y', 'x'], 'ỵ': ['y', 'j'],
                   'í': ['i', 's'], 'ì': ['i', 'f'], 'ĩ': ['i', 'x'], 'ỉ': ['i', 'r'], 'ị': ['i', 'j'],
                   'đ': ['d', 'd']}
    noise_list = []
    noise_list.append(noise_tele1[word])
    noise_list.append(noise_tele2[word])
    noise_list.append(noise_tele3[word])
    return noise_list


def noise_vni(word):
    # cach 1: viet day du dau tai cho
    noise_vni1 = {'à': 'a2', 'á': 'a1', 'ã': 'a4', 'ạ': 'a5', 'ả': 'a3',
                  'â': 'a6', 'ấ': ['a61', 'a16'], 'ầ': ['a62', 'a26'], 'ẫ': ['a64', 'a46'], 'ẩ': ['a63', 'a36'], 'ậ': ['a65', 'a56'],
                  'ă': 'a8', 'ắ': ['a81', 'a18'], 'ằ': ['a82', 'a28'], 'ẵ': ['a84', 'a48'], 'ẳ': ['a83', 'a38'], 'ặ': ['a85', 'a58'],
                  'ê': 'e6', 'ề': ['e62', 'e62'], 'ế': ['e61', 'e16'], 'ễ': ['e64', 'e46'], 'ể': ['e63', 'e36'], 'ệ': ['e65', 'e56'],
                  'é': 'e1', 'è': 'e2', 'ẽ': 'e4', 'ẻ': 'e3', 'ẹ': 'e5',
                  'ó': 'o1', 'ò': 'o2', 'õ': 'o4', 'ỏ': 'o3', 'ọ': 'o5',
                  'ô': 'o6', 'ồ': ['o62', 'o26'], 'ộ': ['o65', 'o56'], 'ổ': ['o63', 'o36'], 'ỗ': ['o64', 'o46'], 'ố': ['o61', 'o16'],
                  'ơ': 'o7', 'ớ': ['o71', 'o17'], 'ờ': ['o72', 'o27'], 'ở': ['o73', 'o37'], 'ợ': ['o75', 'o57'], 'ỡ': ['o74', 'o47'],
                  'ụ': 'u5', 'ú': 'u1', 'ũ': 'u4', 'ủ': 'u3', 'ù': 'u2',
                  'ư': 'u7', 'ứ': ['u71', 'u17'], 'ừ': ['u72', 'u27'], 'ữ': ['u74', 'u47'], 'ử': ['u73', 'u37'], 'ự': ['u75', 'u57'],
                  'ý': 'y1', 'ỳ': 'y2', 'ỷ': 'y3', 'ỹ': 'y4', 'ỵ': 'y5',
                  'í': 'i1', 'ì': 'i2', 'ĩ': 'i4', 'ỉ': 'i3', 'ị': 'i5',
                  'đ': 'd9'}
    # 67
    # viet moi dau o cuoi
    noise_vni2 = {'à': ['a', '2'], 'á': ['a', '1'], 'ã': ['a', '4'], 'ạ': ['a', '5'], 'ả': ['a', '3'],
                  'â': 'a6', 'ấ': ['a6', '1'], 'ầ': ['a6', '2'], 'ẫ': ['a6', '4'], 'ẩ': ['a6', '3'], 'ậ': ['a6', '5'],
                  'ă': 'a8', 'ắ': ['a8', '1'], 'ằ': ['a8', '2'], 'ẵ': ['a8', '4'], 'ẳ': ['a8', '3'], 'ặ': ['a8', '5'],
                  'ê': 'e6', 'ề': ['e6', '2'], 'ế': ['e6', '1'], 'ễ': ['e6', '4'], 'ể': ['e6', '3'], 'ệ': ['e6', '5'],
                  'é': ['e', '1'], 'è': ['e', '2'], 'ẽ': ['e', '4'], 'ẻ': ['e', '3'], 'ẹ': ['e', '5'],
                  'ó': ['o', '1'], 'ò': ['o', '2'], 'õ': ['o', '4'], 'ỏ': ['o', '3'], 'ọ': ['o', '5'],
                  'ô': 'o6', 'ồ': ['o6', '2'], 'ộ': ['o6', '5'], 'ổ': ['o6', '3'], 'ỗ': ['o6', '4'], 'ố': ['o6', '1'],
                  'ơ': 'o7', 'ớ': ['o7', '1'], 'ờ': ['o7', '2'], 'ở': ['o7', '3'], 'ợ': ['o7', '5'], 'ỡ': ['o7', '4'],
                  'ụ': ['u', '5'], 'ú': ['u', '1'], 'ũ': ['u', '4'], 'ủ': ['u', '3'], 'ù': ['u', '2'],
                  'ư': 'u7', 'ứ': ['u7', '1'], 'ừ': ['u7', '2'], 'ữ': ['u7', '4'], 'ử': ['u7', '3'], 'ự': ['u7', '5'],
                  'ý': ['y', '1'], 'ỳ': ['y', '2'], 'ỷ': ['y', '3'], 'ỹ': ['y', '4'], 'ỵ': ['y', '5'],
                  'í': ['i', '1'], 'ì': ['i', '2'], 'ĩ': ['i', '4'], 'ỉ': ['i', '3'], 'ị': ['i', '5'],
                  'đ': 'd9'}
    # viet day du tai cuoi

    noise_vni3 = {'à': ['a', '2'], 'á': ['a', '1'], 'ã': ['a', '4'], 'ạ': ['a', '5'], 'ả': ['a', '3'],
                  'â': ['a', '6'], 'ấ': ['a', '61', '16'], 'ầ': ['a', '62', '26'], 'ẫ': ['a', '64', '46'], 'ẩ': ['a', '63', '36'], 'ậ': ['a', '65', '56'],
                  'ă': ['a', '8'], 'ắ': ['a', '81', '18'], 'ằ': ['a', '82', '28'], 'ẵ': ['a', '84', '48'], 'ẳ': ['a', '83', '38'], 'ặ': ['a', '85', '58'],
                  'ê': ['e', '6'], 'ề': ['e', '62', '26'], 'ế': ['e', '61', '16'], 'ễ': ['e', '64', '46'], 'ể': ['e', '63', '36'], 'ệ': ['e', '65', '56'],
                  'é': ['e', '1'], 'è': ['e', '2'], 'ẽ': ['e', '4'], 'ẻ': ['e', '3'], 'ẹ': ['e', '5'],
                  'ó': ['o', '1'], 'ò': ['o', '2'], 'õ': ['o', '4'], 'ỏ': ['o', '3'], 'ọ': ['o', '5'],
                  'ô': ['o', '6'], 'ồ': ['o', '62', '26'], 'ộ': ['o', '65', '56'], 'ổ': ['o', '63', '36'], 'ỗ': ['o', '64', '46'], 'ố': ['o', '61', '16'],
                  'ơ': ['o', '7'], 'ớ': ['o', '71', '17'], 'ờ': ['o', '72', '27'], 'ở': ['o', '73', '37'], 'ợ': ['o', '75', '57'], 'ỡ': ['o', '74', '47'],
                  'ụ': ['u', '5'], 'ú': ['u', '1'], 'ũ': ['u', '4'], 'ủ': ['u', '3'], 'ù': ['u', '2'],
                  'ư': ['u', '7'], 'ứ': ['u', '71', '17'], 'ừ': ['u', '72', '27'], 'ữ': ['u', '74', '47'], 'ử': ['u', '73', '37'], 'ự': ['u', '75', '57'],
                  'ý': ['y', '1'], 'ỳ': ['y', '2'], 'ỷ': ['y', '3'], 'ỹ': ['y', '4'], 'ỵ': ['y', '5'],
                  'í': ['i', '1'], 'ì': ['i', '2'], 'ĩ': ['i', '4'], 'ỉ': ['i', '3'], 'ị': ['i', '5'],
                  'đ': ['d', '9']}
    noise_list = []
    noise_list.append(noise_vni1[word])
    noise_list.append(noise_vni2[word])
    noise_list.append(noise_vni3[word])
    # return random.choice(noise_list)
    return noise_list

saigon_final3 = {}
saigon_final3['inh'] = 'in'
saigon_final3['ênh'] = 'ên'
saigon_final3['iên'] = 'iêng'
saigon_final3['ươn'] = 'ương'
saigon_final3['uôn'] = 'uông'
saigon_final3['iêt'] = 'iêc'
saigon_final3['ươt'] = 'ươc'
saigon_final3['uôt'] = 'uôc'

saigon_final2 = {}
saigon_final2['ăn'] = 'ăng'
saigon_final2['an'] = 'ang'
saigon_final2['ân'] = 'âng'
saigon_final2['ưn'] = 'ưng'
saigon_final2['ắt'] = 'ăc'
saigon_final2['ât'] = 'âc'
saigon_final2['ưt'] = 'ưc'
saigon_final2['ôn'] = 'ông'
saigon_final2['un'] = 'ung'
saigon_final2['ôt'] = 'ôc'
saigon_final2['ut'] = 'uc'


like_pronunciation2 = {'g': ['gh'], 'gh': ['g'],
                            'c': [ 'k'], 'k': ['c'],
                            'ng': ['ngh'], 'ngh': ['ng']}

